Catalogs/АР_ШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ШаблоныДокументов</Name>
			<Comment>Шаблоны документов MS Word</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьФайлШаблона</Name>
					<Comment>Файл шаблона документа MS Word DOC</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокумент</Name>
					<Comment>Для документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ТипыДокументовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИК</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_УстановкаПараметровИК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыбранныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТЧ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/АР_ФормаВыбораПечатныхФормУправляемая/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ДОПОЛНИТЕЛЬНЫМИ КНОПКАМИ

&НаСервере
// Процедура дополняет таблицу печатных форма (ТаблицаМакетов) объекта
// из справочника "Дополнительные печатные формы"
//
// Параметры:
//  ДеревоМакетов - Дерево значений
//  СсылкаОбъекта - Ссылка объекта метаданных
//  Действие - Действие. Действие кнопки (процедура должна быть описана в форме объекта, на который навешивается подменю)
//  ВнутренниеПечатныеФормы - ТаблицаЗначений, Структура
//  ДобавлятьВДеревоРазделительИПечатьПоУмолчанию - булево
//  ПредставлениеПечатнойФормы - Строка, Наименование элемента справочника ВнешниеОбработки
//
Процедура ЗаполнитьПечатныеФормы()
	
	ВРазрезеИК = Ложь;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокумента", Перечисления.АР_ТипыДокументовПечатныхФорм[МетаданныеОбъекта.Имя]);
	
	ТипОснования = ТипЗнч(Объект.ДокументОснование);
	Если ТипОснования = Тип("ДокументСсылка.АР17_УстановкаПараметровИК") Тогда
		ВРазрезеИК = Истина;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АР_ШаблоныДокументов.Наименование,
		|	АР_ШаблоныДокументов.Код,
		|	АР_ШаблоныДокументов.Ссылка
		|ИЗ
		|	Справочник.АР_ШаблоныДокументов КАК АР_ШаблоныДокументов
		|ГДЕ
		|	НЕ АР_ШаблоныДокументов.ПометкаУдаления
		|	И АР_ШаблоныДокументов.ТипДокумента = &ТипДокумента";
	
	Если ВРазрезеИК Тогда
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.ДокументОснование);
		МассивОбъектов.Добавить(Документы.АР17_УстановкаПараметровИК.ПустаяСсылка());	
		МассивОбъектов.Добавить(Неопределено);
		
		Запрос.УстановитьПараметр("ОбъектИК", МассивОбъектов);
		
		Запрос.Текст = Запрос.Текст + 
		"
		|	И АР_ШаблоныДокументов.ОбъектИК в (&ОбъектИК)";
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаКнопки = ДеревоМакетовПечати.Добавить();
		СтрокаКнопки.Текст = Выборка.Наименование;
		СтрокаКнопки.Код = Выборка.Код;
		СтрокаКнопки.ОбъектИК = Выборка.Ссылка.ОбъектИК.ИКНаименование;
			
	КонецЦикла;
				
КонецПроцедуры // ДобавитьВДеревоМакетовДополнительныеФормы()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = Параметры.Объект;
	
	// Установить заголовок
	Заголовок = "Печать: " + Строка(Объект);
	
	// Сформировать дерево макетов печати
	ЗаполнитьПечатныеФормы();
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ ФОРМЫ

&НаКлиенте
Процедура Печать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоМакетовПечати.ТекущиеДанные;
	Закрыть(ТекущиеДанные.Код);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМакетовПечатиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоМакетовПечати.ТекущиеДанные;
	Закрыть(ТекущиеДанные.Код);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВРазрезеИК Тогда
	    Элементы.ДеревоМакетовПечатиОбъектИК.Видимость = Истина;
	Иначе
		Элементы.ДеревоМакетовПечатиОбъектИК.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
